/*
SQLyog Ultimate v12.5.1 (64 bit)
MySQL - 5.5.27 : Database - msj
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`msj` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `msj`;

/*Table structure for table `category` */

DROP TABLE IF EXISTS `category`;

CREATE TABLE `category` (
  `cid` int(10) NOT NULL AUTO_INCREMENT,
  `cname` varchar(10) NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `category` */

insert  into `category`(`cid`,`cname`,`note`) values 
(1,'中华菜系',NULL),
(2,'各地小吃',NULL),
(3,'外国美食',NULL);

/*Table structure for table `foods` */

DROP TABLE IF EXISTS `foods`;

CREATE TABLE `foods` (
  `fid` smallint(6) NOT NULL AUTO_INCREMENT,
  `fname` varchar(255) NOT NULL,
  `fimg` varchar(255) NOT NULL,
  `fpopnum` smallint(6) DEFAULT '0',
  `fprice` int(50) NOT NULL,
  `fcategory` varchar(50) NOT NULL,
  `fstorenum` int(10) DEFAULT '10',
  PRIMARY KEY (`fid`)
) ENGINE=InnoDB AUTO_INCREMENT=102 DEFAULT CHARSET=utf8;

/*Data for the table `foods` */

insert  into `foods`(`fid`,`fname`,`fimg`,`fpopnum`,`fprice`,`fcategory`,`fstorenum`) values 
(1,'XO酱肠粉','https://s1.st.meishij.net/r/02/165/666252/a666252_151599769171842.jpg',348,30,'中华菜系',14),
(2,'糖醋豆腐','https://s1.st.meishij.net/r/102/220/13242602/a13242602_154398377107983.jpg',416,36,'中华菜系',8),
(3,'农家小炒肉','https://s1.st.meishij.net/r/09/29/13132259/a13132259_155088726506357.jpg',297,26,'中华菜系',5),
(4,'私房小炒肉','https://s1.st.meishij.net/r/102/220/13242602/a13242602_154381870988971.jpg',338,40,'中华菜系',11),
(5,'蒜苗回锅肉','https://s1.st.meishij.net/r/41/203/113291/a113291_155082461119028.jpg',375,25,'中华菜系',15),
(6,'自制意大利青酱','https://s1.st.meishij.net/r/31/161/2290281/a2290281_32414.jpg',367,21,'国外菜谱',17),
(7,'铁板豆腐','https://s1.st.meishij.net/r/41/203/113291/a113291_154339680588737.jpg',5350,40,'中华菜系',7),
(8,'双味卷肠粉','https://s1.st.meishij.net/r/155/126/5469155/a5469155_151662683111446.jpg',425,33,'中华菜系',15),
(9,'青咖喱椰香鸡','https://s1.st.meishij.net/r/31/161/2290281/a2290281_92464.jpg',371,23,'国外菜谱',14),
(10,'口水猪肝','https://s1.st.meishij.net/r/19/99/9087269/a9087269_154287519480154.jpg',5507,21,'中华菜系',12),
(11,'花菜香肠披萨','http://site.meishij.net/r/245/13/2378495/a2378495_149126795680476.jpg',6877,23,'国外菜谱',17),
(12,'叉烧肉','https://s1.st.meishij.net/r/41/203/113291/a113291_154469246342603.jpg',486,29,'中华菜系',8),
(13,'法式果汁糖','https://s1.st.meishij.net/r/05/112/8653005/a8653005_154233332181487.jpg',430,31,'国外菜谱',10),
(14,'家常酸菜鱼','https://s1.st.meishij.net/r/102/220/13242602/a13242602_154278747314922.jpg',296,31,'中华菜系',7),
(15,'手工意大利面视频教程','http://site.meishij.net/r/134/204/5801134/a5801134_149108044752590.jpg',7877,29,'国外菜谱',20),
(16,'椰香艾窝窝','http://site.meishij.net/r/105/225/1306355/a1306355_151436440714026.jpg',4294,20,'各地小吃',18),
(17,'四川宫保鸡丁','https://s1.st.meishij.net/r/41/203/113291/a113291_154805612732655.jpg',373,23,'中华菜系',12),
(18,'寿喜烧','http://site.meishij.net/r/78/120/30078/a30078_150893979724870.jpg',11013,38,'国外菜谱',5),
(19,'地三鲜','https://s1.st.meishij.net/r/83/142/410583/a410583_153728407302198.jpg',262,35,'中华菜系',12),
(20,'麻辣凉皮','https://s1.st.meishij.net/r/208/36/1259208/a1259208_60890.jpg',344,28,'各地小吃',15),
(21,'寿司的制作','http://site.meishij.net/r/219/122/4468219/a4468219_149028082773300.jpg',10356,20,'国外菜谱',20),
(22,'南瓜红枣发糕','http://site.meishij.net/r/234/121/9905484/a9905484_151430023950204.jpg',4031,34,'各地小吃',11),
(23,'辣子鸡块','https://s1.st.meishij.net/r/41/203/113291/a113291_154752150856640.jpg',313,35,'中华菜系',19),
(24,'牛扒意大利面','http://site.meishij.net/r/246/137/1534496/a1534496_150082085827096.jpg',8348,27,'国外菜谱',18),
(25,'土豆炖芸豆','https://s1.st.meishij.net/r/73/127/10031823/a10031823_153568396636101.jpg',4920,25,'中华菜系',6),
(26,'八宝辣酱','https://s1.st.meishij.net/r/31/161/2290281/a2290281_06900.jpg',292,40,'各地小吃',9),
(27,'蛤蜊青酱意面','http://site.meishij.net/r/52/228/9682052/a9682052_149076044003463.jpg',11635,29,'国外菜谱',5),
(28,'驴打滚','http://site.meishij.net/r/102/176/12294102/a12294102_151420913850604.jpg',4847,33,'各地小吃',11),
(29,'溜肉段','https://s1.st.meishij.net/r/41/203/113291/a113291_154771690381024.jpg',310,37,'中华菜系',8),
(30,'黑椒牛排','http://site.meishij.net/r/48/124/9093548/a9093548_150035578659309.jpg',4834,30,'国外菜谱',8),
(31,'少油健康地三鲜','https://s1.st.meishij.net/r/50/123/6030800/a6030800_153561207315836.jpg',4855,36,'中华菜系',6),
(32,'棒棒馍','https://s1.st.meishij.net/r/19/208/1364519/a1364519_95529.jpg',468,26,'各地小吃',9),
(33,'茄汁炒年糕','http://site.meishij.net/r/172/227/5119422/a5119422_149067902932108.jpg',6723,25,'国外菜谱',20),
(34,'咕咕霍夫紫薯发糕','http://site.meishij.net/r/57/175/8481307/a8481307_151334220585210.jpg',5805,36,'各地小吃',13),
(35,'冬瓜丸子汤','https://s1.st.meishij.net/r/102/220/13242602/a13242602_154692255725712.jpg',217,31,'中华菜系',8),
(36,'培根意面','http://site.meishij.net/r/35/102/5838035/a5838035_150021492529794.jpg',8404,35,'国外菜谱',15),
(37,'蒜蓉紫贝菜','https://s1.st.meishij.net/r/216/197/6174466/a6174466_152896341119107.jpg',5504,23,'中华菜系',7),
(38,'上海冷面','https://s1.st.meishij.net/r/31/161/2290281/a2290281_85046.jpg',291,25,'各地小吃',16),
(39,'口蘑扇贝意大利饺','http://site.meishij.net/r/02/165/666252/a666252_149059366421065.jpg',5766,27,'国外菜谱',20),
(40,'彩虹发糕','http://site.meishij.net/r/172/188/7672172/a7672172_151304355076609.jpg',6049,25,'各地小吃',12),
(41,'回锅肉','https://s1.st.meishij.net/r/85/84/8271085/a8271085_154521007825045.jpg',6004,20,'中华菜系',16),
(42,'韩国泡菜炒饭','http://site.meishij.net/r/98/97/9961848/a9961848_149982587771375.jpg',5496,38,'国外菜谱',8),
(43,'麻婆豆腐#午餐','https://s1.st.meishij.net/r/80/133/5970830/a5970830_152834931817261.jpg',5964,35,'中华菜系',15),
(44,'南瓜葡萄干发糕','https://s1.st.meishij.net/r/216/197/6174466/a6174466_152776181739118.jpg',17111,23,'各地小吃',13),
(45,'《仓之食》01卷心菜大决斗之大阪烧','http://site.meishij.net/r/117/177/9731867/a9731867_149036619247142.jpg',3127,28,'国外菜谱',9),
(46,'开花红糖发糕','http://site.meishij.net/r/229/220/2430229/a2430229_151297664167410.jpg',3710,29,'各地小吃',7),
(47,'酸菜鱼','https://s1.st.meishij.net/r/85/84/8271085/a8271085_154520840799943.jpg',6137,30,'中华菜系',14),
(48,'肉松寿司','http://site.meishij.net/r/33/65/9891283/a9891283_149899545839629.jpg',5474,40,'国外菜谱',18),
(49,'家常干锅排骨','https://s1.st.meishij.net/r/174/213/2303424/a2303424_152716573964407.jpg',2970,29,'中华菜系',7),
(50,'金灿灿红火火，一个蒸蒸日上的南瓜发糕','http://s1.st.meishij.net/r/150/187/12421900/a12421900_151779640780422.jpg',3411,23,'各地小吃',14),
(51,'一道萨瓦迪卡的泰式菜','http://site.meishij.net/r/136/65/9078886/a9078886_149025698194590.jpg',3952,39,'国外菜谱',10),
(52,'红枣发糕','http://site.meishij.net/r/208/102/1025708/a1025708_151237456626021.jpg',3735,38,'各地小吃',19),
(53,'鱼香肉丝','https://s1.st.meishij.net/r/85/84/8271085/a8271085_154518238088693.jpg',5695,20,'中华菜系',10),
(54,'三文鱼茶泡饭','http://site.meishij.net/r/172/94/5586172/a5586172_149906464852908.jpg',9177,28,'国外菜谱',6),
(55,'宫保鸡丁','https://s1.st.meishij.net/r/23/237/621773/a621773_152697820674718.jpg',4727,21,'中华菜系',10),
(56,'玉米面发糕','http://s1.st.meishij.net/r/87/178/5169587/a5169587_151670233580367.jpg',7128,21,'各地小吃',8),
(57,'干煎三文鱼配时蔬','http://site.meishij.net/r/238/152/2913238/a2913238_149024709189159.jpg',5030,33,'国外菜谱',6),
(58,'南瓜发糕','http://site.meishij.net/r/230/127/5969480/a5969480_151265387968588.jpg',2694,28,'各地小吃',9),
(59,'白灼虾','https://s1.st.meishij.net/r/41/203/113291/a113291_154529502426378.jpg',223,28,'中华菜系',7),
(60,'肉酱意大利面','http://site.meishij.net/r/89/138/8909589/a8909589_149869904099473.jpg',6145,38,'国外菜谱',9),
(61,'糖醋芝麻豆腐','http://s1.st.meishij.net/r/32/219/3992282/a3992282_151618125373298.jpg',8809,30,'各地小吃',20),
(62,'英式三文鱼饼','http://site.meishij.net/r/134/204/5801134/a5801134_148998361977575.jpg',6562,27,'国外菜谱',15),
(63,'红枣发糕','http://site.meishij.net/r/210/167/9979460/a9979460_151254394811114.jpg',5772,20,'各地小吃',19),
(64,'酸菜白肉','https://s1.st.meishij.net/r/41/203/113291/a113291_154529163422395.jpg',432,38,'中华菜系',8),
(65,'家庭版牛肉派做起来','http://site.meishij.net/r/118/207/10051868/a10051868_149845622448029.jpg',3726,36,'国外菜谱',5),
(66,'酱香芝麻豆腐','http://s1.st.meishij.net/r/32/219/3992282/a3992282_151617393472891.jpg',6202,40,'各地小吃',20),
(67,'意大利面条怎么做？','http://site.meishij.net/r/136/65/9078886/a9078886_149008675993564.jpg',5916,32,'国外菜谱',11),
(68,'红糖红枣发糕','http://site.meishij.net/r/14/171/5480264/a5480264_151236920202487.jpg',5517,39,'各地小吃',17),
(69,'棒棒鸡','https://s1.st.meishij.net/r/41/203/113291/a113291_154339570276229.jpg',433,28,'中华菜系',5),
(70,'黑椒鸡肉汉堡','http://site.meishij.net/r/64/41/7635314/a7635314_149769691812524.jpg',6515,23,'国外菜谱',5),
(71,'大枣花生玉米面发糕','http://site.meishij.net/r/134/61/5140384/a5140384_151573841274165.jpg',7069,28,'各地小吃',10),
(72,'意大利蔬菜汤','http://site.meishij.net/r/136/65/9078886/a9078886_149008428418176.jpg',10087,38,'国外菜谱',12),
(73,'红糖鸡蛋发糕','http://site.meishij.net/r/91/98/10462091/a10462091_151237058794292.jpg',3424,33,'各地小吃',18),
(74,'东北乱炖','https://s1.st.meishij.net/r/41/203/113291/a113291_154466858397209.jpg',288,35,'中华菜系',16),
(75,'棒寿司','http://site.meishij.net/r/172/94/5586172/a5586172_149767875267835.jpg',6737,23,'国外菜谱',10),
(76,'枸杞玉米发糕','http://site.meishij.net/r/235/48/3699735/a3699735_151563328340622.jpg',7578,20,'各地小吃',12),
(77,'意创意大利面','http://site.meishij.net/r/109/94/3273609/a3273609_148981071624078.jpg',4290,29,'国外菜谱',17),
(78,'天然色素，红曲豆面发糕','http://site.meishij.net/r/137/187/359387/a359387_151228963173743.jpg',6918,21,'各地小吃',10),
(79,'干煸四季豆','https://s1.st.meishij.net/r/102/220/13242602/a13242602_154467353560649.jpg',284,26,'中华菜系',13),
(80,'鲭鱼押寿司','http://site.meishij.net/r/172/94/5586172/a5586172_149767798327850.jpg',6445,34,'国外菜谱',15),
(81,'南瓜发糕','http://site.meishij.net/r/25/20/10817525/a10817525_151549154243957.jpg',3918,21,'各地小吃',18),
(82,'寿司','http://site.meishij.net/r/179/125/9031429/a9031429_148980390690802.jpg',4272,22,'国外菜谱',6),
(83,'紫薯爆浆驴打滚','http://site.meishij.net/r/161/132/6595661/a6595661_151219379387676.jpg',3909,30,'各地小吃',9),
(84,'红油蒜泥肘花','https://s1.st.meishij.net/r/19/208/1364519/a1364519_20383.jpg',213,34,'中华菜系',17),
(85,'经典泰国料理冬阴功汤','http://site.meishij.net/r/52/228/9682052/a9682052_149241561149600.jpg',7529,20,'国外菜谱',13),
(86,'驴打滚','http://site.meishij.net/r/172/238/4872172/a4872172_151427225006211.jpg',4293,39,'各地小吃',18),
(87,'简易三文鱼餐','http://site.meishij.net/r/242/113/5090992/a5090992_148976029268196.jpg',2529,34,'国外菜谱',19),
(88,'紫薯发糕','http://site.meishij.net/r/184/195/2611434/a2611434_151212904448744.jpg',8271,22,'各地小吃',12),
(89,'水煮杏鲍菇','https://s1.st.meishij.net/r/157/47/3324407/a3324407_151618486394883.jpg',350,29,'中华菜系',13),
(90,'红枣牛奶发糕','http://site.meishij.net/r/41/172/1918041/a1918041_151515209098027.jpg',3355,28,'各地小吃',7),
(91,'土耳其名菜：苏丹最爱','http://site.meishij.net/r/172/94/5586172/a5586172_148983901912277.jpg',5635,39,'国外菜谱',19),
(92,'南瓜发糕','http://site.meishij.net/r/84/91/10210334/a10210334_151204806171153.jpg',4238,22,'各地小吃',18),
(93,'红糖红枣发糕 宝宝辅食食谱','http://site.meishij.net/r/178/85/5833928/a5833928_151503214445972.jpg',4206,24,'各地小吃',8),
(94,'日本料理 喜烧 （お好み焼き)','http://site.meishij.net/r/18/197/6611768/a6611768_148946350355015.jpg',6075,29,'国外菜谱',8),
(95,'红糖红枣发糕','http://site.meishij.net/r/142/61/5577892/a5577892_151202499093826.jpg',3200,39,'各地小吃',11),
(96,'老北京炸酱面','http://site.meishij.net/r/157/47/3324407/a3324407_151489535046717.jpg',3621,39,'各地小吃',8),
(97,'培根火腿披萨','http://site.meishij.net/r/10/06/4939010/a4939010_148855081807462.jpg',1875,22,'国外菜谱',8),
(98,'蔓越莓红糖弹发糕','http://site.meishij.net/r/47/119/5279797/a5279797_151192105883992.jpg',6323,24,'各地小吃',13),
(99,'薯立方——红薯发糕','http://site.meishij.net/r/104/144/10536104/a10536104_151451732570307.jpg',2604,22,'各地小吃',13),
(100,'驴打滚','http://site.meishij.net/r/98/99/4649848/a4649848_151186583058463.jpg',7206,37,'各地小吃',11),
(101,'薯立方-红薯发糕','http://site.meishij.net/r/104/144/10536104/a10536104_151451635677458.jpg',2479,35,'各地小吃',8);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
